<a href="https://colab.research.google.com/github/trirex79/python/blob/main/Analiza_danych/dane_gieldowe02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import bibliotek

In [ ]:
import numpy as np
import pandas as pd

print(f'Numpy: {np.__version__}')
print(f'Pandas: {pd.__version__}')

Numpy: 1.19.5
Pandas: 1.1.5

# Ładowanie danych

In [ ]:
def fetch_financial_data(company='AMZN'):
    """Pobiera dane dotyczące notowań spółek na giełdzie według symboli
    na serwisie stooq.pl"""
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

df = fetch_financial_data()
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1257 entries, 2021-08-18 to 2016-08-22
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    1257 non-null   float64
 1   High    1257 non-null   float64
 2   Low     1257 non-null   float64
 3   Close   1257 non-null   float64
 4   Volume  1257 non-null   int64
dtypes: float64(4), int64(1)
memory usage: 58.9 KB

# Zapis i odczyt danych z pliku CSV

In [ ]:
df =fetch_financial_data('FB')
df.head()

              Open      High     Low   Close    Volume
Date
2021-08-18  356.25  359.8600  355.15  355.45  10042381
2021-08-17  362.98  364.6700  355.07  358.45  12328737
2021-08-16  362.52  366.9500  357.38  366.56  11232269
2021-08-13  362.97  364.6607  361.48  363.18   7195724
2021-08-12  358.45  363.0000  357.11  362.65   7175206

In [ ]:
df.to_csv('fb.csv')

In [7]:
df_nov = df[(df.index.month == 7) & (df.index.year == 2021)]
df_nov.head()

              Open      High     Low   Close    Volume
Date
2021-07-30  354.00  360.7300  352.94  356.30  15976179
2021-07-29  361.00  365.5200  356.74  358.32  33413244
2021-07-28  374.56  377.5499  366.93  373.28  29676910
2021-07-27  371.91  373.1500  364.55  367.81  15705447
2021-07-26  369.58  374.4400  368.22  372.46  14925222

In [8]:
df_nov.to_csv('fb_november.csv') #modyfikuje dane open w pliku

In [11]:
new_df = pd.read_csv('fb_november.csv')
new_df.head()

         Date    Open      High     Low   Close    Volume
0  2021-07-30  322.00  360.7300  352.94  356.30  15976179
1  2021-07-29  321.00  365.5200  356.74  358.32  33413244
2  2021-07-28  374.56  377.5499  366.93  373.28  29676910
3  2021-07-27  371.91  373.1500  364.55  367.81  15705447
4  2021-07-26  369.58  374.4400  368.22  372.46  14925222

In [12]:
df_nov.to_excel('fb_nov.xlsx')

In [14]:
new_df = pd.read_excel('fb_nov.xlsx')
new_df.head()

        Date    Open      High     Low   Close    Volume
0 2021-07-30  354.00  360.7300  352.94  356.30  15976179
1 2021-07-29  361.00  365.5200  356.74  358.32  33413244
2 2021-07-28  374.56  377.5499  366.93  373.28  29676910
3 2021-07-27  371.91  373.1500  364.55  367.81  15705447
4 2021-07-26  369.58  374.4400  368.22  372.46  14925222

In [15]:
new_df = pd.read_excel('fb_nov.xlsx',index_col=0) #naprawiam index
new_df.head()

              Open      High     Low   Close    Volume
Date
2021-07-30  354.00  360.7300  352.94  356.30  15976179
2021-07-29  361.00  365.5200  356.74  358.32  33413244
2021-07-28  374.56  377.5499  366.93  373.28  29676910
2021-07-27  371.91  373.1500  364.55  367.81  15705447
2021-07-26  369.58  374.4400  368.22  372.46  14925222

# London bike dataset

In [16]:
df = pd.read_csv('london_bike.csv')
df.head()

             timestamp  cnt   t1  ...  is_holiday  is_weekend  season
0  2015-01-04 00:00:00  182  3.0  ...         0.0         1.0     3.0
1  2015-01-04 01:00:00  138  3.0  ...         0.0         1.0     3.0
2  2015-01-04 02:00:00  134  2.5  ...         0.0         1.0     3.0
3  2015-01-04 03:00:00   72  2.0  ...         0.0         1.0     3.0
4  2015-01-04 04:00:00   47  2.0  ...         0.0         1.0     3.0

[5 rows x 10 columns]

In [18]:
df = df.set_index('timestamp')
df.head()

                     cnt   t1   t2  ...  is_holiday  is_weekend  season
timestamp                           ...
2015-01-04 00:00:00  182  3.0  2.0  ...         0.0         1.0     3.0
2015-01-04 01:00:00  138  3.0  2.5  ...         0.0         1.0     3.0
2015-01-04 02:00:00  134  2.5  2.5  ...         0.0         1.0     3.0
2015-01-04 03:00:00   72  2.0  2.0  ...         0.0         1.0     3.0
2015-01-04 04:00:00   47  2.0  0.0  ...         0.0         1.0     3.0

[5 rows x 9 columns]

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17414 entries, 2015-01-04 00:00:00 to 2017-01-03 23:00:00
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cnt           17414 non-null  int64
 1   t1            17414 non-null  float64
 2   t2            17414 non-null  float64
 3   hum           17414 non-null  float64
 4   wind_speed    17414 non-null  float64
 5   weather_code  17414 non-null  float64
 6   is_holiday    17414 non-null  float64
 7   is_weekend    17414 non-null  float64
 8   season        17414 non-null  float64
dtypes: float64(8), int64(1)
memory usage: 2.0+ MB